[
  {
    "hl_text": "years, that's a that's a surplus month. What they've been doing, Scott Bessant, <b>Trump</b>, all these uh right-wing talking heads have been going around and saying, \"This is our first June budget surplus in 20 years",
    "time": 720,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "turned something around. The fact is, under Biden and under <b>Trump</b>, we spend way, way more than we make. And in fact, the big beautiful bills only made it worse. So outside of the the red and the black line",
    "time": 901,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "Yeah. Because you could in my opinion decision three months ago, four months how which it was done. And <b>Trump</b>",
    "time": 1782,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "Yeah. But, you know, as I said, but also as <b>Trump</b> said or Scott Besson said, these Biden deficits are unsustainable. They're horrendous. They",
    "time": 994,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "apparently was fudging the numbers and <b>Trump</b> has just fired her uh this is to me insane. you I I feel like this is the type of thing that I and I know this sits within a sea of actions",
    "time": 1484,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "whatever. You know, <b>Trump</b> has been really hammering Jerome Pow lower interest rates. And when you do that, it's a sign that the you know, like if you raise them, that means inflation is the biggest problem",
    "time": 1556,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "everything <b>Trump</b> has been saying. Like he could have pointed this and said, \"Look, we need to lower interest rates. Jobs are terrible.\" But instead, he is calling it fake news. In fact, jobs are great. We have tons",
    "time": 1578,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "obviously not okay. So he acknowledges was most of <b>Trump</b>'s uh you know graph earlier the estimates originally",
    "time": 1643,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "Bureau of Labor Statistics not <b>Trump</b> is doing and why this doesn't seem I'm curious what you guys think",
    "time": 1692,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "technicalities of why he's removing Obvious thing here, which is <b>Trump</b> has a don't do things what he the way he wants",
    "time": 1793,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "just all know why <b>Trump</b> did this. He calls her woke news fake. He blame what, I think statistically there could",
    "time": 1952,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  },
  {
    "hl_text": "like say I'm a you know say I'm a <b>Trump</b> visas aren't getting renewed uh these foreigners anymore this is renewed",
    "time": 2649,
    "title": "We're Looking For Work | Lemonade Stand 🍋",
    "upload_date": "2025-08-06",
    "video_id": "A2HOczg0Qnw"
  }
]
